--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\oCloud\Home-Cloud\Lehre\BIBB\StataProgBIBB\projekt/01_macro_loops_2021-12-10.log
  log type:  text
 opened on:  10 Dec 2021, 10:45:04

. 
. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. global labormarket LABOUR

. 
. display "$labormarket"
LABOUR

. display "$labourmarket"


. 
. mac list labormarket
labormarket:    LABOUR

. mac list labourmarket
global macro $labourmarket not found
r(111);

end of do-file

r(111);

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. help logit

. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. sysuse auto,clear
(1978 Automobile Data)

. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. list in 1/10

     +-------------------------------------------------------------------------------------------------------------------+
     | make             price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign |
     |-------------------------------------------------------------------------------------------------------------------|
  1. | AMC Concord      4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic |
  2. | AMC Pacer        4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic |
  3. | AMC Spirit       3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic |
  4. | Buick Century    4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic |
  5. | Buick Electra    7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic |
     |-------------------------------------------------------------------------------------------------------------------|
  6. | Buick LeSabre    5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic |
  7. | Buick Opel       4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic |
  8. | Buick Regal      5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic |
  9. | Buick Riviera   10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic |
 10. | Buick Skylark    4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic |
     +-------------------------------------------------------------------------------------------------------------------+

. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. tab rep78

     Repair |
Record 1978 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2        2.90        2.90
          2 |          8       11.59       14.49
          3 |         30       43.48       57.97
          4 |         18       26.09       84.06
          5 |         11       15.94      100.00
------------+-----------------------------------
      Total |         69      100.00

. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. keep if rep78 < 4
(34 observations deleted)

. logit foreign i.am##i.rep78
variable am not found
r(111);

end of do-file

r(111);

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. gen hiprice = price > 4000

. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. list in 1/10

     +-----------------------------------------------------------------------------------------------------------------------------+
     | make             price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   hiprice |
     |-----------------------------------------------------------------------------------------------------------------------------|
  1. | AMC Concord      4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic         1 |
  2. | AMC Pacer        4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic         1 |
  3. | Buick Century    4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic         1 |
  4. | Buick LeSabre    5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic         1 |
  5. | Buick Regal      5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic         1 |
     |-----------------------------------------------------------------------------------------------------------------------------|
  6. | Buick Riviera   10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic         1 |
  7. | Buick Skylark    4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic         1 |
  8. | Cad. Deville    11,385    14       3        4.0      20    4,330      221     44        425       2.28   Domestic         1 |
  9. | Cad. Eldorado   14,500    14       2        3.5      16    3,900      204     43        350       2.19   Domestic         1 |
 10. | Cad. Seville    15,906    21       3        3.0      13    4,290      204     45        350       2.24   Domestic         1 |
     +-----------------------------------------------------------------------------------------------------------------------------+

. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. sysuse auto,clear
(1978 Automobile Data)

. list in 1/10

     +-------------------------------------------------------------------------------------------------------------------+
     | make             price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign |
     |-------------------------------------------------------------------------------------------------------------------|
  1. | AMC Concord      4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic |
  2. | AMC Pacer        4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic |
  3. | AMC Spirit       3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic |
  4. | Buick Century    4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic |
  5. | Buick Electra    7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic |
     |-------------------------------------------------------------------------------------------------------------------|
  6. | Buick LeSabre    5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic |
  7. | Buick Opel       4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic |
  8. | Buick Regal      5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic |
  9. | Buick Riviera   10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic |
 10. | Buick Skylark    4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic |
     +-------------------------------------------------------------------------------------------------------------------+

. keep if rep78 < 4
(34 observations deleted)

. egen hiprice = price > mean(price)
unknown egen function price()
r(133);

end of do-file

r(133);

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. sysuse auto,clear
(1978 Automobile Data)

. list in 1/10

     +-------------------------------------------------------------------------------------------------------------------+
     | make             price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign |
     |-------------------------------------------------------------------------------------------------------------------|
  1. | AMC Concord      4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic |
  2. | AMC Pacer        4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic |
  3. | AMC Spirit       3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic |
  4. | Buick Century    4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic |
  5. | Buick Electra    7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic |
     |-------------------------------------------------------------------------------------------------------------------|
  6. | Buick LeSabre    5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic |
  7. | Buick Opel       4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic |
  8. | Buick Regal      5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic |
  9. | Buick Riviera   10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic |
 10. | Buick Skylark    4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic |
     +-------------------------------------------------------------------------------------------------------------------+

. keep if rep78 < 4
(34 observations deleted)

. egen hiprice = mean(price) < price 
varlist not allowed
r(101);

end of do-file

r(101);

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. 
. 
. 
. sysuse auto,clear
(1978 Automobile Data)

. list in 1/10

     +-------------------------------------------------------------------------------------------------------------------+
     | make             price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign |
     |-------------------------------------------------------------------------------------------------------------------|
  1. | AMC Concord      4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic |
  2. | AMC Pacer        4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic |
  3. | AMC Spirit       3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic |
  4. | Buick Century    4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic |
  5. | Buick Electra    7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic |
     |-------------------------------------------------------------------------------------------------------------------|
  6. | Buick LeSabre    5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic |
  7. | Buick Opel       4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic |
  8. | Buick Regal      5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic |
  9. | Buick Riviera   10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic |
 10. | Buick Skylark    4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic |
     +-------------------------------------------------------------------------------------------------------------------+

. keep if rep78 < 4
(34 observations deleted)

. egen mprice = mean(price) 

. gen hiprice = mprice > price 

. logit hiprice i.foreign##i.rep78

note: 1.rep78 != 0 predicts success perfectly
      1.rep78 dropped and 2 obs not used

note: 3.rep78 omitted because of collinearity
note: 1.foreign#1.rep78 identifies no observations in the sample
note: 1.foreign#2.rep78 identifies no observations in the sample
note: 1.foreign#3.rep78 omitted because of collinearity
Iteration 0:   log likelihood = -21.900697  
Iteration 1:   log likelihood =  -21.86002  
Iteration 2:   log likelihood = -21.859803  
Iteration 3:   log likelihood = -21.859803  

Logistic regression                             Number of obs     =         38
                                                LR chi2(2)        =       0.08
                                                Prob > chi2       =     0.9599
Log likelihood = -21.859803                     Pseudo R2         =     0.0019

-------------------------------------------------------------------------------
      hiprice |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      foreign |
     Foreign  |  -.3566749   1.301098    -0.27   0.784    -2.906781    2.193431
              |
        rep78 |
           1  |          0  (empty)
           2  |   .0487902   .9271051     0.05   0.958    -1.768302    1.865883
           3  |          0  (omitted)
              |
foreign#rep78 |
  Domestic#1  |          0  (empty)
   Foreign#1  |          0  (empty)
   Foreign#2  |          0  (empty)
   Foreign#3  |          0  (omitted)
              |
        _cons |   1.049822    .439155     2.39   0.017     .1890941     1.91055
-------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. help logit

. 
end of do-file

. help margins

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. 
. forvalues i = 1/10 {
  2.     display ""
  3.     forvalues j = 1/5 {
  4.         display `i'-`j' " " _c
  5.     }
  6. }

0 -1 -2 -3 -4 
1 0 -1 -2 -3 
2 1 0 -1 -2 
3 2 1 0 -1 
4 3 2 1 0 
5 4 3 2 1 
6 5 4 3 2 
7 6 5 4 3 
8 7 6 5 4 
9 8 7 6 5 
. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. 
. forvalues i = 1/10 {
  2.     *display ""
.     forvalues j = 1/5 {
  3.         display `i'-`j' " " _c
  4.     }
  5. }
0 -1 -2 -3 -4 1 0 -1 -2 -3 2 1 0 -1 -2 3 2 1 0 -1 4 3 2 1 0 5 4 3 2 1 6 5 4 3 2 7 6 5 4 3 8 7 6 5 4 9 8 7 6 5 
. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. forvalues i = 1/10 {
  2.     display ""
  3.     forvalues j = 1/5 {
  4.         display `i'-`j' " " _c
  5.     }
  6. }

0 -1 -2 -3 -4 
1 0 -1 -2 -3 
2 1 0 -1 -2 
3 2 1 0 -1 
4 3 2 1 0 
5 4 3 2 1 
6 5 4 3 2 
7 6 5 4 3 
8 7 6 5 4 
9 8 7 6 5 
. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. help _c

. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. loc m = 1

. loc g = 2

. tab S1 if m1202 == `m' & gkpol == `g'
variable S1 not found
r(111);

end of do-file

r(111);

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. glo data "D:\Datenspeicher\BIBB_BAuA" // wo liegt der Datensatz?

. 
. use "${data}/BIBBBAuA_2018_suf1.0.dta", clear

. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. 
. loc m = 1

. loc g = 2

. tab S1 if m1202 == `m' & gkpol == `g'

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |         43       50.00       50.00
   weiblich |         43       50.00      100.00
------------+-----------------------------------
      Total |         86      100.00

. 
. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. 
. forvalues g = 1/7 { 
  2.         forvalues m = 0/4 {
  3.                         tab S1 if m1202 == `m' & gkpol == `g'
  4.         }
  5.         }
no observations

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |         22       43.14       43.14
   weiblich |         29       56.86      100.00
------------+-----------------------------------
      Total |         51      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        278       47.44       47.44
   weiblich |        308       52.56      100.00
------------+-----------------------------------
      Total |        586      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |         79       63.20       63.20
   weiblich |         46       36.80      100.00
------------+-----------------------------------
      Total |        125      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        149       46.27       46.27
   weiblich |        173       53.73      100.00
------------+-----------------------------------
      Total |        322      100.00
no observations

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |         43       50.00       50.00
   weiblich |         43       50.00      100.00
------------+-----------------------------------
      Total |         86      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        433       46.81       46.81
   weiblich |        492       53.19      100.00
------------+-----------------------------------
      Total |        925      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        116       67.84       67.84
   weiblich |         55       32.16      100.00
------------+-----------------------------------
      Total |        171      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        240       49.59       49.59
   weiblich |        244       50.41      100.00
------------+-----------------------------------
      Total |        484      100.00
no observations

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        115       48.94       48.94
   weiblich |        120       51.06      100.00
------------+-----------------------------------
      Total |        235      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |      1,239       46.34       46.34
   weiblich |      1,435       53.66      100.00
------------+-----------------------------------
      Total |      2,674      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        301       63.64       63.64
   weiblich |        172       36.36      100.00
------------+-----------------------------------
      Total |        473      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        852       52.89       52.89
   weiblich |        759       47.11      100.00
------------+-----------------------------------
      Total |      1,611      100.00
no observations

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |         98       54.75       54.75
   weiblich |         81       45.25      100.00
------------+-----------------------------------
      Total |        179      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        834       47.25       47.25
   weiblich |        931       52.75      100.00
------------+-----------------------------------
      Total |      1,765      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        193       62.66       62.66
   weiblich |        115       37.34      100.00
------------+-----------------------------------
      Total |        308      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        665       51.71       51.71
   weiblich |        621       48.29      100.00
------------+-----------------------------------
      Total |      1,286      100.00
no observations

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |         46       52.87       52.87
   weiblich |         41       47.13      100.00
------------+-----------------------------------
      Total |         87      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        367       48.80       48.80
   weiblich |        385       51.20      100.00
------------+-----------------------------------
      Total |        752      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |         82       56.94       56.94
   weiblich |         62       43.06      100.00
------------+-----------------------------------
      Total |        144      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        339       53.22       53.22
   weiblich |        298       46.78      100.00
------------+-----------------------------------
      Total |        637      100.00
no observations

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        127       59.91       59.91
   weiblich |         85       40.09      100.00
------------+-----------------------------------
      Total |        212      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        528       46.98       46.98
   weiblich |        596       53.02      100.00
------------+-----------------------------------
      Total |      1,124      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        135       59.47       59.47
   weiblich |         92       40.53      100.00
------------+-----------------------------------
      Total |        227      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        722       51.65       51.65
   weiblich |        676       48.35      100.00
------------+-----------------------------------
      Total |      1,398      100.00
no observations

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        143       59.34       59.34
   weiblich |         98       40.66      100.00
------------+-----------------------------------
      Total |        241      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        692       47.04       47.04
   weiblich |        779       52.96      100.00
------------+-----------------------------------
      Total |      1,471      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |        167       60.29       60.29
   weiblich |        110       39.71      100.00
------------+-----------------------------------
      Total |        277      100.00

 Geschlecht |      Freq.     Percent        Cum.
------------+-----------------------------------
   männlich |      1,048       49.53       49.53
   weiblich |      1,068       50.47      100.00
------------+-----------------------------------
      Total |      2,116      100.00

. 
end of do-file

. do "C:\Users\Filser\AppData\Local\Temp\STD3330_000000.tmp"

. local nlist 2002 2002 2004 2012 

. local ilist 26 27 28 29 

. local jlist 23 22 21 20 

. 
. forval m = 1/4 { 
  2.     gettoken n nlist : nlist 
  3.     gettoken i ilist : ilist 
  4.     gettoken j jlist : jlist 
  5.         di "n = " `n' " i = " `i' " j = " `j'
  6. }
n = 2002 i = 26 j = 23
n = 2002 i = 27 j = 22
n = 2004 i = 28 j = 21
n = 2012 i = 29 j = 20

. 
end of do-file

. help get token

. cap log close
